Привет, реши задачу на python
Дана строка s, которая состоит из символов a, b, c, d.
Подстрокой считаются строки, которые можно получить из строки s, взяв подряд идущие символы. Например строки bcd, abcdcdab, cdcdab являеются подстроками строки abcdcdab, а cd и cdcdcd - нет.
Найди длину самой короткой хорошей подстроки строки s или определи, что у s нет хороших подстрок( в таком случае вывведи -1). Хорошей подстрокой считают подстроку, в которой каждый из символов a, b, c, d встречается в ней хотя бы один раз.
Пример ввода
12 - длина строки
aabbccddbadd - сама строка