# типы данных hashable, изменяемые/неизмняемые

'''
Хэшейбл те, у которых есть метод __hash__()

Вот некоторые примеры типов данных, которые являются hashable в Python:

Числа (int, float, complex)
Строки (str)
Кортежи (tuple)
Некоторые встроенные объекты Python, такие как frozenset

Чаще всего их называют так же, как интерфейс — Map, «отображение», или используют производные от слова «хеш-таблица»:    
Hash, HashMap, HashTable и даже просто Table. Эти названия подчёркивают, каким именно способом был реализован интерфейс отображения.
Встречаются и другие наименования. Например, в Python ассоциативные массивы называют «словарями» (англ. dictionary).
'''
